# FPenColorByClass

## Description
Function FPenColorByClass returns whether the global attributes are set to use the pen colors of the default class.

```pascal
FUNCTION FPenColorByClass : BOOLEAN;
```

```python

def vs.FPenColorByClass():
    return BOOLEAN
```

## Remarks
Returns whether the global attributes are set to use the pen colors of the default class.<BR>
[sd 8/19/98]

## Examples
```pascal
useClassPenColor:=FPenColorByClass;
```

## Version
Availability: from VectorWorks8.0
## Category
* Document Attributes